{"games": [{"name": "A Jornada de Rubens", "team": "Lucas Brandão, Matheus Júlio, Marcelo Cristian, Paulo Souza, Victor Carvalho", "class": "2020.1", "github": "https://github.com/Mathbonc/Game-IP2021.git", "home": "--", "text": "Nós decidimos passar um tempo aprendendo a usar o Github, pois essa seria uma ótima oportunidade para aprender. Foi muito divertido a discussão da história do jogo e as piadas que fizemos dentro dele (Entendedores entenderão), sem falar da emoção de codar faltando pouco tempo (pois usamos parte do tempo para aprender Git e a outra estávamos estudando pra outras cadeiras (Final de período)) mais no fim, conseguimos deixar o jogo funcionando (Com bugs? Não apenas features!) "}, {"name": "Fuja da Área-2", "team": "...?", "web": "https://gbrls.github.io/ip-gallery/fujaDaArea2-equipe-3/simple_game.html", "class": "2020.1"}, {"name": "Cucabeludo", "team": "Luquet, ...?", "class": "2020.1", "web": "https://gbrls.github.io/ip-gallery/equipe-4/simple_game.html"}, {"name": "Fuja", "team": "Jefferson", "home": "https://jefersonn.itch.io/fuja", "class": "2020.3"}, {"name": "A Ameaça Vermelha", "team": "dymb, mbn2, rnm4", "home": "https://mbn2.itch.io/a-ameaca-vermelha", "class": "2020.3", "github": "https://github.com/mulirow/gamejam-ip"}, {"name": "Jacquin's Hell", "team": "Ricardo Morato, Gabriel Schneider, Gabriel Gadelha, Gleibson Rozendo, Leonardo Moreira e Vituriano Xisto", "github": "https://github.com/gbrls/if669-jogo", "home": "https://docs.google.com/document/d/1GUkAA6Tv_SgV5HuBIBtLkdRdiGoB3Gxj1L-__42aXpQ", "class": "2019.2", "text": "Foi muito divertido elaborar este jogo, fizemos amigos e aprendemos muito."}, {"name": "Jojosué's Bizarre Adventures", "team": "Charles Matheus - cmsaGuilherme Morone - gma2Ian Karlo - iktsWilliams Santiago - wssfSamuel Simões - sssf2Thallys Christ - tcsr", "class": "2019.1", "github": "https://github.com/SamuelSimoes31/Jojosue", "home": "", "text": "Foram 2 semanas bem intensas. Fizemos testes com os exemplos da Allegro, enquanto não tínhamos interface gráfica pronta testamos o servidor vimos o mapa como uma matriz no terminal. Os sprites ficaram bem fofinhos, ficava bem certinho no mapa. Fizemos o menu e ciclo do jogo separadamente e juntamos tudo no último dia, de noite, no CIn. Mas deu tudo certo no final."}, {"name": "Punch Kill", "team": "Riei Joaquim, Pedro Nogueira, Victor Ximenes, Fernando Macedo, Washington Santos", "class": "2018.1", "github": "https://github.com/Riei-Joaquim/projeto_ip", "home": "", "text": "Muito divertido, a gente fez com bastante carinho cada parte(porém também passamos raiva demais kkkkkkkkkkk)além disso tivemos alguns anjos para ajudar a gente nessa empreitada"}]}